'''
[문제]
꿈틀꿈틀 호석 애벌레는 "N 개의 먹이가 일렬"로 나열된 나뭇가지를 "오른쪽"으로 기어가려고 한다.
시작하는 순간의 호석 애벌레가 0의 위치에 있고 i 번째 먹이는 오른쪽으로 i 초 기어가야 도달할 수 있다. 
또한 매초 1 만큼 오른쪽으로 무조건 진행한다.

호석 애벌레는 i 번째 먹이가 맛있을수록 높은 만족도를 얻는다.
호석 애벌레는 절제라는 것을 모르는 욕심쟁이기 때문에 "한번 먹이를 먹기 시작하면 연속적으로 계속 먹어야 하며",
"누적된 만족도가 최소 만족도 K 이상이 되거나 더 이상 먹을 먹이가 없을 때에 연속적으로 먹는 것을 멈춘다." 

만약 최소 만족도 이상이 되면 K 를 초과한 만족도만큼 탈피 에너지를 축적한다.
직후에 호석 애벌레의 만족도는 다시 0 이 되고 먹이를 먹을 수 있게 된다.

나뭇가지를 전부 통과했을 때에 소화를 다 못 했을 경우에도 탈피 에너지는 최소 만족도를 넘기는 순간 이미 축적한 것으로 생각하자.

[접근]
문제가 이해가 안된다..

'''